app/Controllers/Admin.php

    public function index()
    {
        $latestKas = $this->KasModel->orderBy('id_kas', 'DESC')->first();
        $saldoTerakhir = $latestKas ? $latestKas['saldo_terakhir'] : 0;

        $queryBarangStokDibawah10 = $this->db->table('barang')->where('stok <', 10)->get()->getResult();
        $stokdibawah10 = count($queryBarangStokDibawah10);

        $waktu24JamYangLalu = date('Y-m-d H:i:s', strtotime('-24 hours'));
        $totalPenjualan24Jam = $this->db->table('penjualan_barang')->where('tanggal_penjualan >=', $waktu24JamYangLalu)->countAllResults();

        // $totalKasMasuk = $this->db->table('kas_toko')
        // ->selectSum('jumlah_akhir')
        // ->where('jenis_transaksi', 'penerimaan')
        // ->get()
        // ->getRow()->jumlah_akhir;
        $totalKasMasuk = $this->db->table('kas_toko')
            ->select('SUM(jumlah_akhir - jumlah_awal) AS total_masuk', false)
            ->where('jenis_transaksi', 'penerimaan')
            ->get()
            ->getRow()->total_masuk;
        // $totalKasMasuk = $this->db->query("
        //     SELECT SUM(jumlah_akhir - jumlah_awal) AS total_masuk
        //     FROM kas_toko
        //     WHERE jenis_transaksi = 'penerimaan'
        // ")->getRow()->total_masuk;
        $totalKasKeluar = $this->db->table('kas_toko')
            ->select('SUM(jumlah_awal - jumlah_akhir) AS total_keluar', false)
            ->where('jenis_transaksi', 'pengeluaran')
            ->get()
            ->getRow()->total_keluar;
---
SELECT *
FROM `barang`
WHERE `stok` < 10
SELECT COUNT(*) AS `numrows`
FROM `penjualan_barang`
WHERE `tanggal_penjualan` >= '2024-09-24 10:15:22'
SELECT SUM(jumlah_awal - jumlah_akhir) AS total_keluar
FROM `kas_toko`
WHERE `jenis_transaksi` = 'pengeluaran'

    public function profil()
    {
        $data['title'] = 'User Profile ';
        $userlogin = user()->username;
        $userid = user()->id;
        $role = $this->db->table('auth_groups_users')->where('user_id', $userid)->get()->getRow();
        $role == '1' ? $role_echo = 'Admin' : $role_echo = 'Pegawai'; // $data['title'] = 'User Profile ';
        $userlogin = user()->username;
        $userid = user()->id;

        // Mengambil data role dari tabel auth_groups_users
        $roleData = $this->db->table('auth_groups_users')->where('user_id', $userid)->get()->getRow();
---
SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '25'

    public function kelola_user()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();

        $groupModel = new GroupModel();
        $no = 1;

        foreach ($data['users'] as $row) {
            $dataRow['group'] = $groupModel->getGroupsForUser($row->id);
            $dataRow['row'] = $row;
            $dataRow['no'] = $no++;
            $data['row' . $row->id] = view('Admin/User/Row', $dataRow);
        }
        $data['groups'] = $groupModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `auth_groups`

    public function Jadwal()
    {
        $data = [
            'title' => 'Daftar Jadwal Imunisasi',
            'jadwal' => $this->JadwalimunisasiModel->findAll(),
        ];
---
SELECT `jadwal_imunisasi`.*, `posyandu`.`nama_posyandu`, `posyandu`.`alamat_posyandu`, `users`.`username`
FROM `jadwal_imunisasi`
JOIN `posyandu` ON `posyandu`.`id` = `jadwal_imunisasi`.`posyandu_id`
JOIN `users` ON `users`.`id` = `posyandu`.`kader_posyandu`
SELECT *
FROM `jadwal_imunisasi`

    public function simpanJadwalPosyandu()
    {
        if (!$this->validate([
            'nama_posyandu' => 'required',
            'alamat_posyandu' => 'required',
            'kader_posyandu' => 'required',
            'bidan' => 'required',
            'tanggal' => 'required|valid_date',
            'jam' => 'required'
        ])) {
            return redirect()->back()->withInput()->with('pesanGagal', 'Input tidak valid, periksa kembali.');
        }

        $this->JadwalimunisasiModel->save([
            'nama_posyandu' => $this->request->getPost('nama_posyandu'),
            'alamat_posyandu' => $this->request->getPost('alamat_posyandu'),
            'kader_posyandu' => $this->request->getPost('kader_posyandu'),
            'bidan' => $this->request->getPost('bidan'),
            'tanggal' => $this->request->getPost('tanggal'),
            'jam' => $this->request->getPost('jam')
        ]);
---
INSERT INTO `jadwal_imunisasi` (`nama_posyandu`, `alamat_posyandu`, `kader_posyandu`, `bidan`, `tanggal`, `jam`) VALUES ('asdaa', 'sdfas', '14', 'asdasd', '2024-09-24', '14:20')