app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
   public function Jadwal()
{
    $userModel = new \Myth\Auth\Models\UserModel(); // Pastikan ini mengacu ke Myth\Auth UserModel
    $users = $userModel->findAll(); // Mengambil semua user sebagai objek