app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT `jadwal_imunisasi`.*, `posyandu`.`nama_posyandu`, `posyandu`.`alamat_posyandu`, `users`.`username`
FROM `jadwal_imunisasi`
JOIN `posyandu` ON `posyandu`.`id` = `jadwal_imunisasi`.`posyandu_id`
JOIN `users` ON `users`.`id` = `posyandu`.`kader_posyandu`
---
    public function index()
    {
        $userModel = new \Myth\Auth\Models\UserModel(); // Model untuk pengguna/kader
        $users = $userModel->findAll(); // Mengambil semua pengguna (kader)

        // Menginisialisasi model
        $jadwalModel = new JadwalimunisasiModel();
        $posyanduModel = new PosyanduModel(); // Model untuk posyandu

        // Mengambil data jadwal dengan join ke tabel posyandu dan users
        $data['jadwal'] = $jadwalModel
            ->select('jadwal_imunisasi.*, posyandu.nama_posyandu, posyandu.alamat_posyandu, users.username')
            ->join('posyandu', 'posyandu.id = jadwal_imunisasi.posyandu_id') // Join dengan tabel posyandu
            ->join('users', 'users.id = posyandu.kader_posyandu') // Join dengan tabel users
            ->findAll();

SELECT *
FROM `data_balita`
WHERE 1 = 1
AND  `nama` LIKE '%asd%' ESCAPE '!'
AND  `nik_balita` LIKE '%2314%' ESCAPE '!'
AND  `no_kk` LIKE '%234%' ESCAPE '!'
---
    public function search()
    {
        $model = new DataBalitaModel();

        // Ambil data dari form pencarian
        $nama = $this->request->getGet('nama');
        $nik_balita = $this->request->getGet('nik_balita');
        $no_kk = $this->request->getGet('no_kk');

        // Lihat data inputan dari form
        // dd($this->request->getGet()); // Akan menampilkan semua input dari form

        // Buat query untuk pencarian
        $query = $model->where('1=1'); // Kondisi awal, selalu benar
        if (!empty($nama)) {
            $query->like('nama', $nama);
        }
        if (!empty($nik_balita)) {
            $query->like('nik_balita', $nik_balita);
        }
        if (!empty($no_kk)) {
            $query->like('no_kk', $no_kk);
        }

        // Dapatkan hasil pencarian
        $data['balita'] = $query->findAll();