app/Controllers/User.php

SELECT *
FROM `jenis_imunisasi`
---
    public function jenis_imunisasi()
    {
        $data = [
            'title' => 'Daftar Jenis Imunisasi',
            'jenis_imunisasi' => $this->JenisImunisasiModel->findAll(),