app/Controllers/User.php

    public function tambahBalita()
    {
        $posyanduModel = new PosyanduModel(); // Model untuk mengambil data posyandu
        $posyandus = $posyanduModel->findAll(); // Mengambil semua data posyandu
---
SELECT *
FROM `posyandu`

        ];
        //  dd($data);
        // Simpan data ke model
        $this->DataBalitaModel->insert($data);
---
INSERT INTO `data_balita` (`nama`, `jenis_kelamin`, `tgl_lahir`, `nama_ortu`, `posyandu_id`, `anak_ke`, `bbl`, `pbl`, `nik_balita`, `no_kk`, `nik_ortu`, `alamat`, `umur`, `bb_awal`, `tb_awal`, `lk_awal`, `tgl_pemeriksaan_awal`) VALUES ('Ara', 'P', '2006-06-06', 'Gatau', '5', '2', '45', '50', '3455237645852834', '7547548756476585', '6757685764576454', 'Kedungwuni', '45', '34', '48', '24', '2024-10-03')

            'balita_id' => $balita_id,
        ];

        $this->DataBalitaDetailModel->insert($dataDetail);
---
INSERT INTO `data_balita_detail` (`bb_awal`, `tb_awal`, `lk_awal`, `tgl_pemeriksaan`, `balita_id`) VALUES ('34', '48', '24', NULL, 14)

    public function editBalita($id)
    {
        $posyanduModel = new PosyanduModel(); // Model untuk mengambil data posyandu
        $posyandus = $posyanduModel->findAll();
        $balita = $this->DataBalitaModel->find($id);
---
SELECT `data_balita`.*, `posyandu`.*
FROM `data_balita`
JOIN `posyandu` ON `posyandu`.`id` = `data_balita`.`posyandu_id`
WHERE `data_balita`.`id` = '5'

    public function Jadwal()
    {
        $userModel = new \Myth\Auth\Models\UserModel();
        $users = $userModel->findAll();

        $jadwalModel = new JadwalimunisasiModel();
        $posyanduModel = new PosyanduModel();

        $userlogin = user()->posyandu_id;


        $data['jadwal'] = $jadwalModel
            ->select('jadwal_imunisasi.*, posyandu.nama_posyandu, posyandu.alamat_posyandu, users.username')
            ->join('posyandu', 'posyandu.id = jadwal_imunisasi.posyandu_id')
            ->join('users', 'users.id = posyandu.kader_posyandu')
            ->where('jadwal_imunisasi.posyandu_id', $userlogin)
            ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT `jadwal_imunisasi`.*, `posyandu`.`nama_posyandu`, `posyandu`.`alamat_posyandu`, `users`.`username`
FROM `jadwal_imunisasi`
JOIN `posyandu` ON `posyandu`.`id` = `jadwal_imunisasi`.`posyandu_id`
JOIN `users` ON `users`.`id` = `posyandu`.`kader_posyandu`
WHERE `jadwal_imunisasi`.`posyandu_id` = '5'