app/Models/DataBalitaDetailModel.php

    public function getPengecekan($id = false)
    {
        if ($id == false) {
            return $this
                ->join('data_balita', 'data_balita.id = data_balita_detail.balita_id')
                ->findAll();
---
SELECT *
FROM `data_balita_detail`
JOIN `data_balita` ON `data_balita`.`id` = `data_balita_detail`.`balita_id`