app/Models/DataBalitaModel.php

    public function getTotalBalita()
    {
        $builder = $this->db->table($this->table)
            ->select('COUNT(*) as total_balita');
---
SELECT COUNT(*) as total_balita
FROM `data_balita`

    public function getBalitaWithPosyandu()
    {
        return $this->select('data_balita.*, posyandu.nama_posyandu')
            ->join('posyandu', 'posyandu.id = data_balita.posyandu_id') // Menggunakan join untuk mengambil data posyandu terkait
            ->findAll();
---
SELECT `data_balita`.*, `posyandu`.`nama_posyandu`
FROM `data_balita`
JOIN `posyandu` ON `posyandu`.`id` = `data_balita`.`posyandu_id`

    public function getJumlahBalitaPerPosyandu()
{
    return $this->db->table('posyandu p')
        ->select('p.nama_posyandu, COUNT(b.id) AS jumlah_balita')
        ->join('data_balita b', 'p.id = b.posyandu_id', 'left')
        ->groupBy('p.nama_posyandu')
        ->get()
        ->getResultArray();
---
SELECT `data_balita`.*, `posyandu`.`nama_posyandu`
FROM `data_balita`
JOIN `posyandu` ON `posyandu`.`id` = `data_balita`.`posyandu_id`