app/Models/PenjualanBarangModel.php

SELECT *
FROM `penjualan_barang`
ORDER BY `tanggal_penjualan` ASC
---
    public function getAllSales()
    {
        return $this->orderBy('tanggal_penjualan', 'ASC')->findAll();